{"/":{"title":"An Archive of Pining Stats","data":{"":"Welcome! This is a short and hastily thrown together project to extract trend information about certain Pining-related tags from the Ao3 2021 Selective data dump for fan statisticians","about-the-source-data#About the source data":"This is an overview, more detailed information here\nOn March 3rd, 2021, the Archive of Our Own released a Selective data dump for fan statisticians. This data dump contains a subset of the data from the Archive, including all works, as all tags.\nThe availbable data spans between  and .The total sample size that this project covers is  works.","tags#Tags":"Ao3 uses a tagging system that allows users to tag their works with as many tags as they want. This means that a work can be tagged with all three of the tags above, or just one of them. This project is focused on the \"yearning\" tag and it's related tags.\nThe following tags are included in this project:\nYearning\nPining\nSlow Burn\n\nAo3 has a freeform tagging system, which means that users can tag their works with whatever tags they want. For example, the following tags are all variations of the \"pining\" tag:\n\"Unacknowledged pining\"\n\"Unnecessary Pining\"\n\"Vágyakozás\"\n\"暗恋\"\n\"Y E A R N I N G\"\n\"Yearning\"\n\"Yearning and Longing\"\n\"Yearning to the MAX\"\n\"frustrated pining\"\n\"gay ass yearning\"\n\"Pining!\"\n\"PINING!!\"\n\"PINING!!!\"\n\"Pining???\"\n\"pining??\"\n\"pining?\"\n\nThankfully, Ao3 uses Tag Wranglers who work with categorizing and merging together related tags, making my work a lot easier. I have been trying to use Canonical Tags as much as possible.Please note that the Yearning tag is folded into the \"Pining\" tag, and are by Ao3 considered Synonyms.","presentation#Presentation":"","chart-controls#Chart Controls":"","a-history-of-yearning#A history of yearning":"This is a chart representing how many number of works for each of the yearning related tags are published .","queering-yearning#Queering yearning":"What is queerness? Get a definitive answer here\nThis chart is about showing how works about yearning break down along the Straight/Gay/Polysexual/Aro lines. Please note that just like in real life, bi erasure is a thing, and in this case happens because works tend to center the pairing itself (M/M, F/F, M/F) rather than characters sexualities.","yearning-queerness-in-proportion#Yearning queerness in proportion":"This chart shows the percentage of queer-tag related to the total number of works for that period. This will give a hint, but it is possible that a work is counted twice, if for example, a work is tagged with both \"M/M\" and \"F/M\".The observant reader might note that the beginning of this graph is a LOT more unstable than it is later, this is due to the comparatively small number of data being published making just couple of works a day have a large impact on the graph.","absolute-yearning-in-context#Absolute yearning in context":"The below chart is with the added line of EVERYTHING EVER SUBMITTED TO AO3 (of which yearning takes up a non-trivial percentage).","relative-yearning#Relative yearning":"Since all of Ao3 has seen an increase in works over the years, it might be more interesting to see the relative increase in works for each of the tags. This chart shows the  percentage of works, compared to the total number of works for that period.","relative-yearning-in-context#Relative yearning in context":"This chart compares the relative increase in works for each of the tags, compared to the total number of works for that period, with the relative increase in works for all of Ao3.\nThis chart compares two different types of data, and as such, the Y-axis is not directly comparable between the two lines.\nThe gray line is how many works has been submitted to Ao3, and is meant to give an idea of the growth rate of the website, and the other lines show what percentage of those works are tagged with the selected tags.","relative-yearning-compared-with-popular-cousins#Relative yearning compared with popular cousins.":"In this chart we compare the yearning related tags to some of the most popular tags on Ao3; Fluff, AU and Angst, in order to be able to compare the growth of yearning with what might be expected on the website.","method#Method":"","download-and-extract-the-data-dump#Download and extract the data dump":"The data was extracted from the Ao3 2021 Selective data dump for fan statisticians using a custom script.\nIn its initial form the data comes in two files, tags-20210226.csv and works-20210226.csv.Processing these many records takes a long time, especially when parsing is involved, so the data has to be simplified.","tags-20210226csv#tags-20210226.csv":"14,467,138 records - 581,5MiB\nid\ttype\tname\tcanonical\tcached_count\tmerger_id\t1\tMedia\tTV Shows\ttrue\t910\t2\tMedia\tMovies\ttrue\t1164\t3\tMedia\tBooks & Literature\ttrue\t134\t4\tMedia\tCartoons & Comics & Graphic Novels\ttrue\t166\t...\t...\t...\t...\t...\t6716\tCharacter\tHillary Clinton\ttrue\t659\t\t6717\tRelationship\tHillary Clinton/Barack Obama\ttrue\t3\t\t6719\tFreeform\tPining\ttrue\t122227\t\t6720\tRelationship\tClark Kent/OFC\tfalse\t8\t11395045\t6721\tRelationship\tRedacted\tfalse\t2\t12721","works-20210226csv#works-20210226.csv":"7,269,693 records - 968,1MiB\ncreation date\tlanguage\trestricted\tcomplete\tword_count\ttags\t2021-02-26\ten\tfalse\ttrue\t388\t10+414093+1001939+4577144+1499536+110+4682892+21+16\t2021-02-26\ten\tfalse\ttrue\t1638\t10+20350917+34816907+23666027+23269305+23269308+25382106+54629895+265399+105139+6207045+2509086+4483454+21741408+2791+21+16\t2021-02-26\ten\tfalse\ttrue\t1502\t10+10613413+9780526+3763877+3741104+7657229+30052928+54862740+54862743+3958232+3741113+13041709+8689774+39239518+21073668+36386338+54862746+54862749+54862752+24+14\t2021-02-26\ten\tfalse\ttrue\t100\t10+15322+54862755+20595867+32994286+663+4717518+2096+54862758+54862761+54862764+54862767+21+16\t...\t...\t...\t...\t...","filter-out-irrelevant-data#Filter out irrelevant data":"In order to make this dataset more manageable, we filter out all tags that matches the following criteria:\nThe tag is not of \"Freeform\" type, which means that it is not a user-created tag.\nThe tag is not related one of the tags below, and doesn't have a canonical related tag:\nYearning\nPining\nSlow Burn\n\n\nThe tag wasn't selected as \"Comparable\" to yearning, in order to be able to compare the growth of yearning with what might be expected on the website.\nFluff\nAU\nAngst","count-each-of-the-72-million-works-and-relevant-tags#Count each of the ~7.2 million works, and relevant tags":"This step is just number crunching, counting the following statistics:\nHow many works are published per day per selected tag\nHow many of those works have an associated \"queerness\" tag.\nHow many works are published per day in total\nHow many works are published per day per selected tag, compared to the total number of works published that day (To determine relative growth rate)\nHow many works are published per day, compared to the total number of works ever (To determine growth rate)","source-data#Source data":"On March 3rd, 2021, the Archive of Our Own released a Selective data dump for fan statisticians. This data dump contains a subset of the data from the Archive, including all works, as all tags.\nThe availbable data spans between  and .The total sample size that this project covers is  works.","tags-20210226csv-1#tags-20210226.csv":"14,467,138 records - 581,5MiB","id#ID":"The ID of the tag","type#Type":"Media - A tag that describes the media type of the work, such as \"TV Shows\" or \"Movies\"\nRating - A tag that describes the rating of the work, such as \"Mature\" or \"Explicit\"\nArchiveWarning - A tag that describes the archive warning of the work, such as \"Creator Chose Not To Use Archive Warnings\" or \"Graphic Depictions Of Violence\"\nCategory - A tag that describes the category of the work, such as \"F/M\" or \"Multi\"\nCharacter - A tag that describes the character of the work, such as \"Harry Potter\" or \"Hermione Granger\"\nFandom - A tag that describes the fandom of the work, such as \"Harry Potter - J. K. Rowling\" or \"Marvel Cinematic Universe\"\nRelationship - A tag that describes the relationship of the work, such as \"Harry Potter/Draco Malfoy\" or \"James Potter/Lily Evans Potter\"\nFreeform - A user created tag, such as \"Yearning\" or \"Pining\"\nUnsortedTag - I don't know what this is.","name#Name":"Name of the tag","canonical#Canonical":"Whether or not the tag is a canonical tag, e.g. the \"main\" tag for a group of tags, like \"Yearning\" is for \"Pining\":\n\n\n\nAll of the above are considered synonyms of \"Pining\", and are folded into the \"Pining\" tag.","cached-count#Cached Count":"The rough number of works that are tagged with this tag.","merger-id#Merger ID":"If the tag is not canonical, then this is the ID of the canonical tag that it is folded into.","works-20210226csv-1#works-20210226.csv":"7,269,693 records - 968,1MiB","creation-date#Creation date":"Date of creation, in the format YYYY-MM-DD","language#Language":"Language of the work, in the format en for English, fr for French, etc.","restricted#Restricted":"Whether or not the work is restricted to logged in users only.","complete#Complete":"Whether or not the work is marked as complete.","word-count#Word Count":"The word count of the work.","tags-1#Tags":"IDs of the tags that the work is tagged with, separated by +.","defining-queer#Defining Queer":"This project extracts data whether a project has queer tags or not, but what does that mean?\nSadly, it's difficult to define what is queer and what isn't, but I have tried to do so in the following way:","queer-tags#Queer tags":"Using tags for defining how to \"count\" a work can be difficult, as tags are both contextual and subjective, and frankly, all over the place.\nI use a loose matching system where a tag only needs to partly match any of the search terms, and then it is considered a match.For example: \"Bisexual\" matches \"Bisexual mess\". This is not ideal, but it is the best I can do with the time I have.The following tags have been considered tags that define the \"sexuality\" of a work:","gay#Gay":"M/M\nF/F\nGay\nLesbian","straight#Straight":"F/M\nM/F\nStraight","straight-1#Straight":"Bisexual\nPansexual character\nPolysexual","aromantic--asexual#Aromantic / Asexual":"Asexual\nAromanticThe way that this filtering system is implemented, it will catch non-canonical tags like \"ultra gay\", but sadly also \"not gay\". This is therefore to be considered a rough estimate, and not a definitive source of data.","downloads#Downloads":"","csv-files#CSV Files":"Aggregate files relating to yearning and work statistics for Ao3.\n\nAggregate files relating to tags comparable to yearning\n\nAggregate files relating to queer tags."}}}